Repository: vbarrier/teslamate
Catalog: priv/gettext/*/LC_MESSAGES/errors.po
Languages: th

source: can't be blank
th: ไม่สามารถเว้นว่างได้

source: has already been taken
th: ถูกเลือกไปแล้ว

source: is invalid
th: ไม่ถูกต้อง

source: must be accepted
th: จะต้องยอมรับ

source: has invalid format
th: มีรูปแบบที่ไม่ถูกต้อง

source: has an invalid entry
th: มีรายการไม่ถูกต้อง

source: is reserved
th: ถูกสงวนไว้

source: does not match confirmation
th: ไม่ตรงกับการยืนยัน

source: is still associated with this entry
th: ยังคงเกี่ยวข้องกับรายการนี้

source: are still associated with this entry
th: ยังคงเกี่ยวข้องกับรายการนี้

source: should be %{count} character(s)
th: ควรเป็น %{count} อักขระ

source: should have %{count} item(s)
th: ควรมี %{count} รายการ

source: should be at least %{count} character(s)
th: ควรมีอักขระอย่างน้อย %{count} ตัว

source: should have at least %{count} item(s)
th: ควรมีอย่างน้อย %{count} รายการ

source: should be at most %{count} character(s)
th: ควรมีอักขระไม่เกิน %{count} ตัว

source: should have at most %{count} item(s)
th: ควรมีมากที่สุด %{count} รายการ

source: must be less than %{number}
th: ต้องน้อยกว่า %{number}

source: must be greater than %{number}
th: ต้องมากกว่า %{number}

source: must be less than or equal to %{number}
th: ต้องน้อยกว่าหรือเท่ากับ %{number}

source: must be greater than or equal to %{number}
th: ต้องมากกว่าหรือเท่ากับ %{number}

source: must be equal to %{number}
th: ต้องเท่ากับ %{number}
